WSC_I85B65/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

14
(
    wall_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       599;
    }
    wall_top
    {
        type            patch;
        nFaces          1;
        startFace       600;
    }
    front1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          50;
        startFace       601;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back1;
    }
    back1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          50;
        startFace       651;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front1;
    }
    left1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          50;
        startFace       701;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right1;
    }
    right1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          50;
        startFace       751;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left1;
    }
    front2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       801;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back2;
    }
    back2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       901;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front2;
    }
    left2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       1001;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right2;
    }
    right2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       1101;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left2;
    }
    front3
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          450;
        startFace       1201;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back3;
    }
    back3
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          450;
        startFace       1651;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front3;
    }
    left3
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          450;
        startFace       2101;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right3;
    }
    right3
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          450;
        startFace       2551;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left3;
    }
)

// ************************************************************************* //
